Revit 2026 API

# DuplicateTypeNamesHandlerArgs Properties

---

The DuplicateTypeNamesHandlerArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | The document that contains the types with duplicate names. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

DuplicateTypeNamesHandlerArgs Class

Autodesk.Revit.DB Namespace